# IFCParameter Template Create Method

Source: https://www.revitapidocs.com/2026/8812ffd9-ff0a-8a1c-a9f3-44757e967df9.htm

---

| IFCParameter Template Create Method |
| --- |

Create an IFC parameter mapping template with default values.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IFCParameterTemplate Create(
	Document document,
	string name
)
```

```
Public Shared Function Create (
	document As Document,
	name As String
) As IFCParameterTemplate
```

```
public:
static IFCParameterTemplate^ Create(
	Document^ document,
	String^ name
)
```

```
static member Create :
        document : Document *
        name : string -> IFCParameterTemplate
```

#### Parameters

document Document
:   The document where created mapping template is saved.

name String
:   The name specified to this mapping template.

#### Return Value

IFCParameterTemplate
The new mapping template instance. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The name already exists. |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace